Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>pAdImg1YQxbw8svW9A5nzf1kNGilxWxY78VQUQwZ+nQaAppSfaLpX4M/81bOA2I1n8dvVzoHd0iP&#13;
9OSHC8k6wBmbUQPfsgVIfoNd63zoxK6sXQNjjOlRpTCoKV1s6ltGU2zYb9I3QFnp5WBSE2HK6SMG&#13;
Be8HqzMPBeZICMaKfNk=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>ZIougPWIriGtXzw3O/DIqB5ZVekC6EVEOeLYhVnPihjl17k0ay6JEjdQFF+FqShQRpWRNua2a/CV&#13;
VQpPMH6xyMdrP7bho6KjCX9Aias3eKkTD+14IZrDiZOB0Ta5qMuJ+JxGt2WV9j/M76AW/yWk3M6I&#13;
+3/vlDwK3DRJAUa3+AiUiMCtateS7HUypCuYaiPmdnCc306pNItrtNBcR9PBPURnsosAgI5kKXOx&#13;
Av2fqQ3IWXEUz9PlNo0HYLCy20L5yOX1CpPS/tc2tXIeg2F5gxTua5jycCE8QeXfkqmk1vNBkOA7&#13;
AOBU2HQT0WuoNAahpizJ87e7yJb6A6Ju+2Nyna00QZGNxTC4RjqckKNeWDCmnP4E+MLN/C0tp9If&#13;
kfZ3pI3VFpvaO2ZweJw8SCEVn+ONUhkxyT+MAcX9pBKniwDxLuBkHmJ2zWG61Hmd1et0mFWvQzyn&#13;
hN8jwbSfX/Hy9yVHKYbfMA2AH1aH55eo7miTxodWiAdYT6IUQrHLRUjtOS2N7Nd+pGk3HbK9ccbN&#13;
hhjjKD40ItCywR59ZPMHlYfJywJLkA/iv7ENbYVrHpcMTtPgNBOIJE7pzGuIQauMlpRRlxEi6rVe&#13;
/mZDL5Oegaj1JjArIvV/59DQvpzXKi4GrKSDVas3DhA8rhHZndpuJtKP5huwrJPCDiL1gzUHHwox&#13;
PnRplIjHkYTGt94idDxyfZR5BqjqdWsvIE9+9NP88Q6fulgr65Q+EpJDoqp6UXYifnMY7Ydc9gf8&#13;
rYojK3Ig/hlxJ4isP5DdEtA7hy2FxOpbfbbHhNqZ2Q25ASH9cjN8qjXzFV+XWX6bs99EXWsusrIe&#13;
8owEj6g8lncejwkPFLRCV1fpCnveJQPjCgqAresEWhbAvl68pi5nidDR5GaoT/kP23kd+r5w3+kw&#13;
ETettG1nkaT8Jma2Cmxby+7zIXhS8I9ne41zc3TbjGUpjYZg</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>B9sV6fNtHqa5CBooHGPcK1WiXNE=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
GtbfhXfUPllnZ+PlH14DUFCEqhgnekSYuoWpNvD7klKS/52FfSTCwd3qa1BYUdVdccSfQ6migrm/&#13;
q24WOe9ot20usxFqyYnkhNeotk+t9CjmAsPdHs4nz5fY/R16T+4k3L5xU1Yco65sMlNp7FMsH+vC&#13;
9Z4r1dWfIXcf1KLktEI=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>